app/views/orders/index.html.erb

    <td><%= order.reportgroup %></td>
    <td><%= order.orderid %></td>
---
SELECT "orders".* FROM "orders"