app/controllers/authreversals_controller.rb

  def show
    @authreversal = Authreversal.find(params[:id])
---
SELECT "authreversals".* FROM "authreversals" WHERE "authreversals"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @authreversal = Authreversal.new(params[:authreversal])

    respond_to do |format|
      if @authreversal.save
---
INSERT INTO "authreversals" ("amount", "created_at", "litletxnid", "merchantid", "merchanttxnid", "reportgroup", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)