app/controllers/captures_controller.rb

  def index
    @captures = Capture.all
---
SELECT "captures".* FROM "captures"

  def show
    @capture = Capture.find(params[:id])
---
SELECT "captures".* FROM "captures" WHERE "captures"."id" = ? LIMIT 1  [["id", "3"]]

  def edit
    @capture = Capture.find(params[:id])
---
SELECT "captures".* FROM "captures" WHERE "captures"."id" = ? LIMIT 1  [["id", "18"]]

  def create
    @capture = Capture.new(params[:capture])

    respond_to do |format|
      if @capture.save
---
INSERT INTO "captures" ("address1", "amount", "cardmonth", "cardnumber", "cardyear", "city", "country", "created_at", "cvv", "email", "firstname", "lastname", "litletxnid", "merchantid", "merchanttxnid", "orderid", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @capture = Capture.find(params[:id])

    respond_to do |format|
      if @capture.update_attributes(params[:capture])
---
SELECT "captures".* FROM "captures" WHERE "captures"."id" = ? LIMIT 1  [["id", "18"]]
UPDATE "captures" SET "litletxnid" = '81979545556017225', "updated_at" = '2012-02-08 20:44:36.628490' WHERE "captures"."id" = 18