app/controllers/credits_controller.rb

SELECT "credits".* FROM "credits"
---
  def index
    @credits = Credit.all

SELECT "credits".* FROM "credits" WHERE "credits"."id" = ? LIMIT 1  [["id", "9"]]
---
def show
    @credits = Credit.find(params[:id])

INSERT INTO "credits" ("address1", "amount", "cardmonth", "cardnumber", "cardyear", "city", "country", "created_at", "cvv", "email", "firstname", "lastname", "litletxnid", "merchantid", "merchanttxnid", "orderid", "reportgroup", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @credit = Credit.new(params[:credit])

    respond_to do |format|
      if @credit.save