app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.all

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @order = Order.find(params[:id])

INSERT INTO "orders" ("address1", "amount", "cardmonth", "cardnumber", "cardyear", "city", "country", "created_at", "cvv", "email", "merchantid", "merchanttxnid", "name", "orderid", "ordersource", "reportgroup", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def create
  @order = Order.new(params[:order])

  respond_to do |format|
    if @order.save