app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
    @sales = Sale.all

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @sale = Sale.find(params[:id])

INSERT INTO "sales" ("address1", "amount", "cardmonth", "cardnumber", "cardyear", "city", "country", "created_at", "cvv", "email", "firstname", "lastname", "litletxnid", "merchantid", "merchanttxnid", "orderid", "ordersource", "reportgroup", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @sale = Sale.new(params[:sale])

    respond_to do |format|
      if @sale.save