app/controllers/tokens_controller.rb

SELECT "tokens".* FROM "tokens"
---
  def index
    @tokens = Token.all

SELECT "tokens".* FROM "tokens" WHERE "tokens"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @token = Token.find(params[:id])

INSERT INTO "tokens" ("address1", "cardmonth", "cardnumber", "cardyear", "city", "country", "created_at", "cvv", "email", "merchantid", "merchanttxid", "name", "state", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @token = Token.new(params[:token])

    respond_to do |format|
      if @token.save