app/controllers/voids_controller.rb

  def index
    @voids = Void.all
---
SELECT "voids".* FROM "voids"

  def show
    gateway = ActiveMerchant::Billing::LitleGateway.new

    @void = Void.find(params[:id])
---
SELECT "voids".* FROM "voids" WHERE "voids"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @void = Void.find(params[:id])
---
SELECT "voids".* FROM "voids" WHERE "voids"."id" = ? LIMIT 1  [["id", "12"]]

  def create
    @void = Void.new(params[:void])

    respond_to do |format|
      if @void.save
---
INSERT INTO "voids" ("created_at", "litletxnid", "merchantid", "merchanttxnid", "reportgroup", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @void = Void.find(params[:id])
---
SELECT "voids".* FROM "voids" WHERE "voids"."id" = ? LIMIT 1  [["id", "12"]]